In [2]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass

In [3]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 ········

## 1 Write a query to display for each store its store ID, city, and country.

In [4]:
%%sql
select store_id, city, country
from sakila.store
join (sakila.address join (sakila.city join sakila.country using (country_id)) using (city_id)) using (address_id);

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, 'Lethbridge', 'Canada'), (2, 'Woodridge', 'Australia')]

## 2 Write a query to display how much business, in dollars, each store brought in.

In [5]:
%%sql
select store.store_id, round(sum(amount), 2)
from sakila.store join (sakila.customer join (sakila.payment join sakila.rental using (rental_id)) on customer.customer_id = payment.customer_id) using (store_id)
group by store.store_id;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, Decimal('36997.53')), (2, Decimal('30409.03'))]

## 3 What is the average running time of films by category?

In [6]:
%%sql
select category.name, avg(length)
from sakila.film join sakila.film_category using (film_id)
                 join sakila.category using (category_id)
group by category.name
order by avg(length) desc;

 * mysql+pymysql://root:***@localhost/sakila
16 rows affected.

[('Sports', Decimal('128.2027')),
 ('Games', Decimal('127.8361')),
 ('Foreign', Decimal('121.6986')),
 ('Drama', Decimal('120.8387')),
 ('Comedy', Decimal('115.8276')),
 ('Family', Decimal('114.7826')),
 ('Music', Decimal('113.6471')),
 ('Travel', Decimal('113.3158')),
 ('Horror', Decimal('112.4821')),
 ('Classics', Decimal('111.6667')),
 ('Action', Decimal('111.6094')),
 ('New', Decimal('111.1270')),
 ('Animation', Decimal('111.0152')),
 ('Children', Decimal('109.8000')),
 ('Documentary', Decimal('108.7500')),
 ('Sci-Fi', Decimal('108.1967'))]

## 4 Which film categories are longest?

In [7]:
%%sql
select category.name, avg(length)
from sakila.film join sakila.film_category using (film_id)
                 join sakila.category using (category_id)
group by category.name
order by avg(length) desc;

 * mysql+pymysql://root:***@localhost/sakila
16 rows affected.

[('Sports', Decimal('128.2027')),
 ('Games', Decimal('127.8361')),
 ('Foreign', Decimal('121.6986')),
 ('Drama', Decimal('120.8387')),
 ('Comedy', Decimal('115.8276')),
 ('Family', Decimal('114.7826')),
 ('Music', Decimal('113.6471')),
 ('Travel', Decimal('113.3158')),
 ('Horror', Decimal('112.4821')),
 ('Classics', Decimal('111.6667')),
 ('Action', Decimal('111.6094')),
 ('New', Decimal('111.1270')),
 ('Animation', Decimal('111.0152')),
 ('Children', Decimal('109.8000')),
 ('Documentary', Decimal('108.7500')),
 ('Sci-Fi', Decimal('108.1967'))]

## 5 Display the most frequently rented movies in descending order.

In [9]:
%%sql
select title, count(*) as `rental frequency`
from sakila.film
join (sakila.inventory join sakila.rental using (inventory_id))
using (film_id)
group by title
order by `rental frequency` desc
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('BUCKET BROTHERHOOD', 34),
 ('ROCKETEER MOTHER', 33),
 ('FORWARD TEMPLE', 32),
 ('JUGGLER HARDLY', 32),
 ('GRIT CLOCKWORK', 32)]

## 6 List the top five genres in gross revenue in descending order.

In [10]:
%%sql
select name, category_id, sum(amount) as `gross revenue`
from sakila.payment
join (sakila.rental join (sakila.inventory join (sakila.film_category join sakila.category using (category_id)) using (film_id)) using (inventory_id)) using (rental_id)
group by category_id
order by `gross revenue` desc
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('Sports', 15, Decimal('5314.21')),
 ('Sci-Fi', 14, Decimal('4756.98')),
 ('Animation', 2, Decimal('4656.30')),
 ('Drama', 7, Decimal('4587.39')),
 ('Comedy', 5, Decimal('4383.58'))]

## 7 Is "Academy Dinosaur" available for rent from Store 1?

In [11]:
%%sql
select film.film_id, film.title, store.store_id, inventory.inventory_id
from sakila.inventory
join sakila.store using (store_id)
join sakila.film using (film_id)
where film.title = 'Academy Dinosaur' and store.store_id = 1;

 * mysql+pymysql://root:***@localhost/sakila
4 rows affected.

[(1, 'ACADEMY DINOSAUR', 1, 1),
 (1, 'ACADEMY DINOSAUR', 1, 2),
 (1, 'ACADEMY DINOSAUR', 1, 3),
 (1, 'ACADEMY DINOSAUR', 1, 4)]